---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.Profile1OffsetX
source: html/3f6d25f0-173a-f6d4-43e5-fc7d0e863ca4.htm
---
# Autodesk.Revit.DB.ParameterTypeId.Profile1OffsetX Property

"Horizontal Profile Offset"

## Syntax (C#)
```csharp
public static ForgeTypeId Profile1OffsetX { get; }
```